tutorials/rhoCentralFoam/biconic25-55Run35/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Pr              Pr [0 0 0 0 0 0 0] 0.72;

thermoType      hThermo<pureMixture<sutherlandTransport<specieThermo<janafThermo<perfectGas>>>>>;
//thermoType      hThermo<pureMixture<blottnerTransport<specieThermo<janafThermo<perfectGas>>>>>;

// Replacates constThermo (Cp = const)
/*
mixture N2
    1 28.01348
    0 10000 1000
    3.5 0 0 0 0 0 0
    3.5 0 0 0 0 0 0
//    3.5 0 0 0 0 -1043.52 0
//    3.5 0 0 0 0 -1043.52 0
//    0.0268142 0.3177838 -11.3155513; // Blottner
    1.458e-06 110; // Sutherland
*/
// janafThermo

mixture N2
    1 28.01348
    100 10000 1000
    2.9525407 0.0013968838 -4.9262577e-07 7.8600091e-11 -4.6074978e-15
    -923.93753 5.8718221
    3.5309628 -0.0001236595 -5.0299339e-07 2.4352768e-09 -1.4087954e-12
    -1046.9637 2.9674391
//    0.0268142 0.3177838 -11.3155513; // Blottner
    1.458e-06 110; // Sutherland

// ************************************************************************* //
