tutorials/rhoCentralFoam/biconic25-55Run35/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

startFrom       latestTime;

startTime       0.005;

stopAt          endTime;

endTime         1e-07;

deltaT          1e-10;

writeControl    adjustableRunTime;

writeInterval   1e-07;

cycleWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1;

// ************************************************************************* //
